/*2151294 信11 马威*/
#include<iostream>
using namespace std;
int main()
{
	int y, m, d;                         /*定义所需变量，y是年份，m是月份，d是日*/
	cout << "请输入年，月，日" << endl;  /*输出提示语*/
	cin >> y >> m >> d;                  /*输入变量值*/

	/*取日期完成，下面进行天数转化*/
	/*主要思路：分开各个月处理。*/
	/*若月份不正确，则报错；若月份正确，判断日与月的关系*/
	/*若关系合理，则输出变量d+该月之前的月总天数；若关系非法，则报错*/

	/*闰年的天数转化*/
	if ((y % 4 == 0) && (y % 100 != 0) || (y % 4 == 0) && (y % 400 == 0)) {

		/*闰年1月的天数转化*/
		if (1 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年2月的天数转化*/
		else if (2 == m) {
			if (d <= 29) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 31 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年3月的天数转化*/
		else if (3 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 60 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年4月的天数转化*/
		else if (4 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 91 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年5月的天数转化*/
		else if (5 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 121 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年6月的天数转化*/
		else if (6 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 152 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年7月的天数转化*/
		else if (7 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 182 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年8月的天数转化*/
		else if (8 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 213 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年9月的天数转化*/
		else if (9 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 244 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年10月的天数转化*/
		else if (10 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 274 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年11月的天数转化*/
		else if (11 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 305 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年12月的天数转化*/
		else if (12 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 335 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*闰年不正确月份的报错*/
		else
		    cout << "输入错误-月份不正确" << endl;
	}

	/*非闰年的天数转化*/
	else {

	    /*非闰年1月的天数转化*/
	    if (1 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年2月的天数转化*/
		else if (2 == m) {
			if (d <= 28) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 31 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年3月的天数转化*/
		else if (3 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 59 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年4月的天数转化*/
		else if (4 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 90 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年5月的天数转化*/
		else if (5 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 120 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年6月的天数转化*/
		else if (6 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 151 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年7月的天数转化*/
		else if (7 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 181 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年8月的天数转化*/
		else if (8 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 212 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年9月的天数转化*/
		else if (9 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 243 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年10月的天数转化*/
		else if (10 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 273 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年11月的天数转化*/
		else if (11 == m) {
			if (d <= 30) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 304 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年12月的天数转化*/
		else if (12 == m) {
			if (d <= 31) {
				cout << y << "-" << m << "-" << d << "是" << y << "年的第" << d + 334 << "天" << endl;
			}

			else
				cout << "输入错误-日与月的关系非法" << endl;
		}

		/*非闰年不正确月份的报错*/
		else
		    cout << "输入错误-月份不正确" << endl;
}

	return 0;
}