/*2151294 信11 马威*/
#include <iostream>
#include <cmath>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：
	 功    能：返回n阶legendre多项式的值
	 输入参数：
	 返 回 值：
	 说    明：函数名、形参、返回类型均不准动
   ***************************************************************************/
double legendre(double x, int n)
{
	double result;     /*定义所需变量，result是最后的返回值*/
	if (n > 1) {       /*若n不为1，递归调用legendre(n-1)和legendre(n-2)，使result等于给定式子的值*/
		result = ((2 * n - 1) * x * legendre(x, n - 1) - (n - 1) * legendre(x, n - 2)) / n;
	}
	
	else if (n == 1) { /*若n为1，legendre(1)返回值为x*/
		return x;
	}

	else if (n == 0) { /*若n为0，legendre(0)返回值为1*/
		return 1;
	}

	return result;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：完成输入、调用递归函数、输出
***************************************************************************/
int main()
{
	double x;     /*定义所需变量x、n*/
	int n;
	cout << "计算legendre，请输入x和n的值" << endl;     /*输出提示语*/
	cin >> x >> n;                                      /*输入x、n*/
	cout << "legendre[" << n << "](" << x << ")=" << legendre(x, n) << endl;     /*按格式输出结果*/
	return 0;
}