/*2151294 信11 马威*/
#include <iostream>
using namespace std;

#define  N  10	/* 假设最多转换10个数字 */

/* 不允许再定义其它函数、全局变量 */

int main()
{
	/* 如果有不需要的变量，允许删除，但不允许添加或替换为其它类型的变量 */
	char str[256], * p;
	int  a[N] = { 0 }, * pnum, * pa;
	bool is_num;

	/* 上面的定义不准动(删除不需要的变量除外)，下面为程序的具体实现，要求不得再定义任何变量、常量、常变量 */
	cout << "请输入间隔含有若干正负数字的字符串" << endl;
	gets_s(str);  /*输入字符串*/

	/*p指向字符串首地址，pa、pnum指向数值数组首地址*/
	p = str, pa = a, pnum = a;

	/*p指向尾零时跳出循环*/
	while (*p != '\0') {

		/*判断p指向的是否为数字*/
		if (*p >= '0' && *p <= '9')
			is_num = true;
		else
			is_num = false;

		/*若p指向数字*/
		if (is_num) {

			/*若首数字为零，p继续向前移动，直到不为零为止*/
			if (*p == '0') {
				while (*p != '0')
					p++;
			}

			/*若停止处为数字，每取得一个数字，将pa指向的变量乘以10再加上该数字，直到无数字为止，达到逐个赋值的效果*/
			while (*p >= '0' && *p <= '9') {
				*pa = *pa * 10 + (*p - '0');
				p++;
			}

			/*完成后，pa向前移动*/
			pa++;
		}

		/*若此时p未指向尾零，则p继续向前移动寻找数字，防止越界*/
		if (*p)
			p++;
	}

	/*根据pa与a首地址的差值，得出数字个数*/
	cout << "共有" << pa - a << "个整数" << endl;

	/*使用pnum指向a中的变量并逐个输出，直到pa指向的位置为止*/
	while (pnum != pa) {
		cout << *pnum << " ";
		pnum++;
	}

	cout << endl;
	return 0;
}